LuaVan/Luan_van/src/Documents/ProgramApproval/ProgramApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramApproval</name>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevel</types>
    </type>
  </attributes>
  <attributes>
    <name>BasedOnProposal</name>
    <type>
      <types>DocumentRef.ProgramProposal</types>
    </type>
  </attributes>
  <attributes>
    <name>CouncilSession</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Decision</name>
    <type>
      <types>EnumRef.ApprovalDecision</types>
    </type>
  </attributes>
  <attributes>
    <name>RevisionNotes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>SignerSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>VotingResults</name>
    <attributes>
      <name>CouncilMember</name>
      <type>
        <types>CatalogRef.Lecturers</types>
      </type>
    </attributes>
    <attributes>
      <name>Vote</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

LuaVan/Luan_van/src/InformationRegisters/ProgramValidity/ProgramValidity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProgramValidity</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>TrainingProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </dimensions>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>Note</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

LuaVan/Luan_van/src/Enums/ProgramStatuses/ProgramStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProgramStatuses</name>
  <enumValues>
    <name>Draft</name>
  </enumValues>
  <enumValues>
    <name>FacultyReview</name>
  </enumValues>
  <enumValues>
    <name>InstitutionalReview</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Issued</name>
  </enumValues>
  <enumValues>
    <name>Expired</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Enums/ApprovalDecision/ApprovalDecision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalDecision</name>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>RequiresRevision</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
</mdclass:Enum>

LuaVan/Luan_van/src/Documents/ProgramApproval/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ProgramApproval - Module đối tượng
// Posting: Cập nhật trạng thái CTĐT trong IR ProgramValidity
//   Status = Document.Status (nếu set), nếu không fallback theo logic:
//   - ApprovalLevel=Issued → Issued
//   - Decision=Approved → Approved
//   - khác → UnderReview
////////////////////////////////////////////////////////////////////////////////

Procedure Posting(Cancel, PostingMode)
	ResolvedStatus = Status;
	If ResolvedStatus.IsEmpty() Then
		If ApprovalLevel = Enums.ApprovalLevel.Issued Then
			ResolvedStatus = Enums.ProgramStatuses.Issued;
		ElsIf Decision = Enums.ApprovalDecision.Approved Then
			ResolvedStatus = Enums.ProgramStatuses.Approved;
		Else
			ResolvedStatus = Enums.ProgramStatuses.UnderReview;
		EndIf;
	EndIf;

	RegisterRecords.ProgramValidity.Write = True;
	Record = RegisterRecords.ProgramValidity.Add();
	Record.Period = Date;
	Record.TrainingProgram = TargetProgram;
	Record.Status = ResolvedStatus;
	If Not IssuanceDecision.IsEmpty() Then
		Record.IssuanceDecision = IssuanceDecision;
	EndIf;
	Record.Note = CouncilSession;
EndProcedure
